#pragma once

#include "basic.h"

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

struct _basic_curve // база для кривых и оракулов
{
	struct _element_chart // краткая информация элемента графика
	{
		int    n;    // порядковый номер элемента !!! -1 = нет элемента
		int    time; // время
		double min;  // минимальное значение
		double max;  // максимальное значение
	};

	virtual ~_basic_curve() {}

	virtual i64  get_n() = 0; // количество элементов
	virtual void get_n_info(i64 n, _element_chart* e) = 0; // получить краткую информацию n-го элемента
	virtual void get_t_info(int t, _element_chart* e) = 0; // получить краткую информацию элемента со временем >= t
	virtual void draw(i64 n, _area area) = 0; // нарисовать 1 элемент
	virtual void recovery() = 0; // восстановить

	virtual i64  prediction() { return 0; } // предсказание времени роста
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

