#pragma once

#include "basic.h"

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

struct _basic_curve // база дл€ кривых и оракулов
{
	struct _element_chart // кратка€ информаци€ элемента графика
	{
		i64    n;    // пор€дковый номер элемента !!! -1 = нет элемента
		time_t time; // врем€
		double min;  // минимальное значение
		double max;  // максимальное значение
	};

	virtual ~_basic_curve() {}

	virtual i64  get_n() = 0; // количество элементов
	virtual void get_n_info(i64 n, _element_chart* e) = 0; // получить краткую информацию n-го элемента
	virtual void get_t_info(int t, _element_chart* e) = 0; // получить краткую информацию элемента со временем >= t
	virtual void draw(i64 n, _area area) = 0; // нарисовать 1 элемент
	virtual void recovery() = 0; // восстановить

	virtual i64  prediction() { return 0; } // предсказание времени роста
	virtual void save_to_file() {}
	virtual void load_from_file() {}
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

struct _latest_events // последние событи€ !!! дл€ нервозных предсказателей !!! удалить, если их уже нет !!!
{
	char event[4]; // [0] - последнее событие
	int minute[4]; // на какой минуте случилось
	double   x[4]; // значени€

	int  start();  // ща будет рост в X минут
	bool stop();   // ща будет падение
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
