#pragma once

/*//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

выделяет кружками количество (cc.sale[1].number == 570)
!! не актуально, но можно оставить и при надобности изменить на какой нибудь другой параметр

без предсказания

/*//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include "basic_oracle.h"

struct _view_stat : public _basic_curve // тестовое отображение статистических данных
{
	struct _cen_pak      // данные по минуте
	{
		time_t time = 0; // общее время
		_iinterval ncc;  // диапазон цен
		ushort min  = 0; // минимальная цена
		ushort max  = 0; // макимальная цена
		int k       = 0; // количество совпадений

		bool operator < (time_t a) const noexcept { return (time < a); } // для алгоритма поиска по времени
	};

	std::vector<_cen_pak> cen1m; // упакованные цены по минутам

	i64 get_n()                               override { return cen1m.size(); } // количество элементов
	void get_n_info(i64 n, _element_chart* e) override; // получить краткую информацию n-го элемента
	void get_t_info(time_t t, _element_chart* e) override; // получить краткую информацию элемента со временем >= t
	void draw(i64 n, _area area)              override; // нарисовать 1 элемент
	void recovery()                           override; // обновить
	void save_to_file()                       override;
	void load_from_file()                     override;
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

